scribbles/app/controllers/accounts_controller.rb

INSERT INTO "accounts" ("name", "secure_password", "salt", "email", "expiration", "is_permanent", "created_at", "updated_at") VALUES('user9', 'a61ea6c002fc21c77107dcf33c1f6d84a823873d', 'o6d2dWg26S', 'user9@user9.com', -1, 't', '2009-12-12 04:53:48', '2009-12-12 04:53:48')
SELECT "accounts".id FROM "accounts" WHERE ("accounts"."name" = 'kj') LIMIT 1
INSERT INTO "documents" ("name", "body", "account_id", "lock_holder", "password", "created_at", "updated_at") VALUES('My Document', '', 9, NULL, NULL, '2009-12-12 04:53:48', '2009-12-12 04:53:48')
---
  def register
    # Some validation
    #if not isValid(params)
    #  return
    #end

    # Validation done, now save it
    @newAcc = Account.new
    @newAcc.name = params[:name]
    @newAcc.password = params[:password]
    @newAcc.password_confirmation = params[:password2]
    @newAcc.email = params[:email]
    @newAcc.expiration = -1;
    @newAcc.is_permanent = true

    # Try to save
    if @newAcc.save
      # Log user in
      @current_user = Account.find_by_name(@newAcc.name)
      session[:user_id] = @current_user.id

      # Create default doc for account
      newDoc = Document.new
      newDoc.name = DEFAULT_DOC_NAME
      newDoc.account_id = @current_user.id
      newDoc.body = ""
      newDoc.save