scribbles/app/controllers/documents_controller.rb

SELECT * FROM "accounts" WHERE ("accounts"."name" = 'linh' AND "accounts"."password" = 'linh') LIMIT 1
---
  def login
    @current_user = Account.find_by_name_and_password(params[:username], params[:password])