scribbles/app/controllers/documents_controller.rb

SELECT "accounts".id FROM "accounts" WHERE ("accounts"."name" = 'whoa') LIMIT 1
SELECT * FROM "documents" WHERE ("documents"."account_id" = 1 AND "documents"."name" = 'default') LIMIT 1
---
  def index
    # Get the account of this page
    @doc_account = Account.find_by_name(params[:pagename])

    # If this page's account exists, get the default doc for the account
    if @doc_account
      @this_doc = Document.find_by_account_id_and_name(@doc_account.id, DEFAULT_DOC_NAME)

SELECT * FROM "documents" WHERE ("documents"."id" = '1') LIMIT 1
---
  def RetrieveBody
    @body = Document.find(:first, :conditions => {:id => params[:in_doc]}).body

SELECT * FROM "documents" WHERE ("documents"."id" IS NULL) LIMIT 1
UPDATE "documents" SET "body" = 'This is the body!', "updated_at" = '2009-12-12 08:36:39' WHERE "id" = 1
---
  def UpdateBody
    # Get the existing document
    doc = Document.find(:first, :conditions => {:id => params[:in_doc]})
    doc.update_attribute(:body, params[:documentBody])

SELECT * FROM "comments" WHERE ("comments"."document_id" = '2') ORDER BY created_at DESC
---
  def RetrieveComments
    @comments = Comment.find(:all,
                            :conditions => {:document_id => params[:in_doc]},
                            :order => "created_at DESC")

INSERT INTO "comments" ("author", "comment", "document_id", "created_at", "updated_at") VALUES('hi', 'whoa nice', 1, '2009-12-12 06:00:22', '2009-12-12 06:00:22')
---
  def AddComment
    comment = Comment.new(:author => params[:name],
                          :comment => params[:comment],
                          :document_id => params[:in_doc])
    comment.save

SELECT * FROM "file_tabs" WHERE ("file_tabs"."document_id" = '1') ORDER BY updated_at DESC
---
  def RetrieveFiles
    @files = FileTab.find(:all,
                          :conditions => {:document_id => params[:in_doc]},
                          :order => "updated_at DESC")

SELECT * FROM "file_tabs" WHERE ("file_tabs"."document_id" = '1' AND "file_tabs"."name" = '0001-ruby-1.9-friendly-secure_compare.patch')
UPDATE "file_tabs" SET "description" = 'Gradient aadfads', "updated_at" = '2009-12-12 07:57:02' WHERE "id" = 3
INSERT INTO "file_tabs" ("name", "path", "description", "document_id", "created_at", "updated_at") VALUES('beyonddescription.pdf', 'public/files/1/beyonddescription.pdf', 'lkjgsjflkjf salsafs', 1, '2009-12-11 08:58:43', '2009-12-11 08:58:43')
---
  def UploadFile
    upload = params[:upload]
    name = upload['datafile'].original_filename
    directory = "public/files/" + params[:in_doc]
    if not FileTest::directory? directory
      Dir::mkdir directory
    end
    path = File.join(directory, name)

    # Check if file already exists
    file = FileTab.find(:first, :conditions => {:document_id => params[:in_doc],
                                                :name => name})

    # If file exists, update the record
    if file
      file.update_attribute(:description, params[:description])
    # Else, if file doesn't exist, add new record
    else
      # Add to DB
      file = FileTab.new(:name => name,
                         :path => path,
                         :description => params[:description],
                         :document_id => params[:in_doc])
      file.save

SELECT * FROM "documents" WHERE ("documents"."id" = '1') LIMIT 1
UPDATE "documents" SET "lock_holder" = 'Another person', "updated_at" = '2009-12-12 10:03:45' WHERE "id" = 1
---
  def AcquireLock
    # Get the document and lock
    doc = Document.find(:first, :conditions => {:id => params[:in_doc]})
    lock = doc.lock_holder

    # If lock is not held, then print 'Lock yours'
    if lock == ""
      @message = "Lock yours"

      # Assign user's name to lock
      if @current_user
        doc.update_attribute(:lock_holder, @current_user.name)

SELECT * FROM "documents" WHERE ("documents"."id" = '1') LIMIT 1
UPDATE "documents" SET "lock_holder" = '', "updated_at" = '2009-12-12 10:08:16' WHERE "id" = 1
---
  def ReleaseLock
    doc = Document.find(:first, :conditions => {:id => params[:in_doc]})
    doc.update_attribute(:lock_holder, "")

SELECT * FROM "documents" WHERE ("documents"."id" = '1') LIMIT 1
UPDATE "documents" SET "secure_password" = '29583b68a00f30520b8db898b79819cc78a22626', "updated_at" = '2009-12-12 11:15:08' WHERE "id" = 1
---
  def SetPassword
    # Get the document and set password
    doc = Document.find(:first, :conditions => {:id => params[:in_doc]})
    doc.update_attribute(:password, params[:password])