scribbles/app/controllers/home_controller.rb

  def login
    @current_user = Account.find_by_name_and_password(params[:username], params[:password])
---
SELECT * FROM "accounts" WHERE ("accounts"."name" = 'linh' AND "accounts"."password" = 'linh') LIMIT 1